// სავარჯიშო 5:
 
// მომხმარებელს შემოატანინეთ ქულა, თუ რიცხვი ტოლია 100, მაშინ გამოიტანეთ, რომ თქვენ დაგიფინანსდათ სწავლა სრულიად, თუ ქულა მეტია 70 ზე, მაშინ გამოიტანეთ, თქვენ დაგიფინანსდათ სწავლა 3000 ლარით, თუ შემოტანილი ქულა მეტია 40 ზე, მაშინ გამმოიტანეთ, თქვენ დაგიფინანსდათ სწავლა 1000 ლარით, ხოლო თუ შემოტანილი ქულა ნაკლებია 20 ზე, მაშინ დაწერეთ თქვენ არ დაფინანსდათ სწავლა.

let a = 100
let b = 20 
let x = 70
let y = 40
let z = Number(prompt('Enter your score  0-100 :   '))

if(z===a){
    alert('თქვენ დაგიფინასდათ სწავლა სრულიად')
}else if (z > x){
    alert('თქვენ დაგიფინასდათ სწავლა 3000 ლარით')
}else{
    alert('თქვენ დაგიფინასდათ სწავლა 1000 ლარით')
}

// help me pls 