// დავალება 1

// for loop

// 1.დაბეჭდეთ რიცხვები 1-დან 10-მდე.

// for(let i = 0; i <= 10; i++) {
//     console.log(i)
// }


// ########################################################################################

// 2.დაბეჭდეთ ლუწი რიცხვები 1-დან 20-მდე.

// for(let i = 2; i <= 20; i += 2) {
//     console.log(i)
// }

// ########################################################################################


// 3.იპოვეთ რიცხვების ჯამი 1-დან 50-მდე.(გამოიყენეთ ცალკე sum ცვლადი)

// let sum = 0;
// for (let i = 1; i <= 50; i ++){
//    sum += 1;
//     console.log(i)
// }

// console.log("რიცხვების ჯამი 1-დან 50-მდე: " + sum);

// let sum = 1;
// for (let i = 1; i <= 50; i += 1){

//     console.log(i)
// }

// ########################################################################################

// 4. შექმენით რიცხვის გამრავლების ცხრილი.

    function multipical_table(size) {
        let table = ""

        for(let i = 1; i <= size; i++) {
            for(let g = 1; g <= size; g++){
                table += (i * j) + "\t"
            }
            table +=" \n"
        }
        return table
    }

console.log(multipical_table(10))

// help

// ########################################################################################

// 5.შეამოწმეთ რიცხვი მარტივია თუ არა.

// help

// ########################################################################################

// 6. დაბეჭდეთ რიცხვები 100 დან 0 ამდე 🙂

// for(let i = 0; i <= 100; i++) {
//     console.log(i)
// }


// ########################################################################################

// 7.გაიგეთ რამდენი ასოსგან  შედგება "ILOVEGOA" 

// let text = 'ILOVEGOA'

// for(let i = 0; i < text.length) {
//     console.log(i)
// }


// ########################################################################################

// 8.გამოიტანეთ სათითაოდ ყველა ასო წინა დავალებაში მოცემული ტექსტიდან


// let text = 'ILOVEGOA'

// for(let i = 0; i < text.length) {
//     console.log(text[i])
// }