// მომხმარებელეს შემოატანინეთ 2 რიცხვი, თუ პირველი რიცხვი მეტია მეორე რიცხვზე, მაშინ გამოიტანეთ 'პირველი რიცხვი არის მეორე რიცხვზე მეტი', თუ მეორე რიცხვი არის მეტი პირველ რიცხვზე, მაშინ გამოიტანეთ 'მეორე რიცხვი მეტია პირველზე', ხოლო თუ ეს ორი რიცხვი ერთმანეთის ტოლია მაშინ გამოიტანეთ 'ეს რიცხვები ერთმანეთის ტოლია!'




let x = Number(prompt('enter first num: '))
let y = Number(prompt('enter second num: '))

if(x > y){
    console.log('პირველი რიცხვი მეტია მეორეზე')
}else if(x < y){
    console.log('მეორე რიცხვი მეტია პირველზე')
}else{
    console.log('ეს რიცხვები ერთმანეთის ტოლია')
}