// Day 74:



// 1) შექმენით საიტი სადაც მომხმარებელს prompt ის გამოყენებით შემოატანინებთ 2 რიცხვს, ამ ორ რიცხვს შორის ჩაატარეთ არითმეტიკული ოპერაციები და დაბეჭდეთ კონსოლში

//code:

// let a = Number(prompt('chosee any a number:'))
// let b = Number(prompt('chosee any b number:'))

// alert(a + b )
// alert(a * b )
// alert(a / b )
// alert(a - b )



// 2) შექმენით საიტი სადაც მომხმარებელს შემოატანინებთ სახელს და გვარს, საბოლოოდ კი alert ფუნქციის გამოყენებით გამოიტანეთ საიტზე Welcome name lastname


//look at homework site for this homework


// 3) შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი start და end, ფუნქციაში for ციკლის გამოყენებით გამოიანგარიშეთ ამ რიცხვებს შორის ყველა რიცხვის ჯამი და დააბრუნეთ მიღებული შედეგი


//help


// 4) შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი start და end, ფუნქციაში for ციკლის გამოყენებით გამოიანგარიშეთ ამ რიცხვებს შორის ყველა ლუწი რიცხვის ჯამი და დააბრუნეთ მიღებული შედეგი გამოიყენეთ if


//help


// 5) შექმენით ფუნქცია სახელად isTeenager, რომელიც იღებს ორ პარამეტრს: ასაკი (რიცხვი) და hasPermission. ფუნქცია უნდა დაბრუნდეს False, თუ ადამიანი არის მოზარდი (18 წლამდე) და არ აქვს ნებართვა აიღოს მართვის მოწმობა, ან თუ ადამიანი არის 18 წლის და აქვს უფლება აიღოს მართვის მოწმობა ფუნქციამ დააბრუნოს true.  გამოიყენეთ "and" (&&) და "or" (||) 


// function isTeenager(age, hasPermission) {

//     if (age < 18 && hasPermission) {
//         return false;
//     } else if (age >= 18 && hasPermission) {
//         return true;
//     } else {
//         return false;
//     }

// }


//help


// 6)  შექმენით ფუნქცია სახელად isValidCoupon, რომელიც იღებს ორ პარამეტრს: couponCode (სტრინგი) და totalAmount (რიცხვი). ფუნქცია უნდა დაბრუნდეს true, თუ კუპონის კოდი არის "SALE" ან "BIGSALE" და ჯამური თანხა მეტია ან ტოლია 50-ზე, ან თუ კუპონის კოდი არის "LILSALE" მთლიანი თანხის მიუხედავად. წინააღმდეგ შემთხვევაში, ის უნდა დაბრუნდეს false. გამოიყენეთ "და" (&&) და "ან" (||)


//help