// დავალება 2

// while loop


// გააკეთეთ ათვლა რის ბოლოსაც გამოიტანს "HAPPY NEW YEAR!"


// help

// ამობეჭდეთ კენტი რიცხვები 1-დან 20-მდე.


// help

// გამოთვალეთ რიცხვის ფაქტორიალი. (ფაქტორული არის მათემატიკური ოპერაცია, რომელიც წარმოდგენილია სიმბოლოთი !. იგი გამოიყენება ყველა დადებითი რიცხვის ნამრავლის გამოსათვლელად 1-დან მოცემულ დადებით რიცხვამდე მაგალითად 5ის ფაქტორიალია 1* 2* 3* 4* 5)


// help

// 4.დაპრინტეთ პირველი 10 ნატურალური რიცხვის ჯამი(მინიშნება შექმენით ცვლადი სადაც შეინახავს რიცხვების ჯამს)


// help

// 5.prompt() ფუნქციის დახმარებით მომხმარებელს შემოაქვს ორი რიცხვი a და b. while ციკლის გამოყენებით ტერმინალში გამოიტანეთ რიცხვები a-დან b-მდე

// let a = prompt('select any a num:  ')
// let b = prompt('select any b num:  ')




// heelp

// დაბეჭდეთ რიცხვები 100 დან 0 ამდე 🙂
 
// let nums = 0

// while(nums <= 100) {
//     console.log(nums)
//     nums += 1
// }
