// დავალება 2


// while ციკლი

// 1)დაპრინტეთ პირველი 10 ნატურალური რიცხვი

// for (let i = 0; i < 11; i++){
//     console.log(i)
// }


// 2) დაპრინტეთ პირველი 10 ნატურალური რიცხვი უკუსვლით


// for (let i = 0; i < 0; i--){
//     console.log(i)
// }


// help



// 3) დაპრინტეთ ლუწი  რიცხვები 0-დან 100-ის ჩათვლით

// help

// 4) დაპრინტეთ კენტი რიცხვები 99-დან 1-ის ჩათვლით უკუსვლით

// help

// 5) დაპრინტეთ პირველი 10 ნატურალური რიცხვის ჯამი(მინიშნება შექმენით ცვლადი სადაც შეინახავს რიცხვების ჯამს)

// help

// 6)  input() ფუნქციის დახმარებით მომხმარებელს შემოაქვს ორი რიცხვი a და b. for ციკლის გამოყენებით ტერმინალში გამოიტანეთ რიცხვები a-დან b-მდე ( range(a, b) )

// help


// while ციკლი


// 1)  დაპრინტეთ პირველი 10 ნატურალური რიცხვი



// 2) დაპრინტეთ პირველი 10 ნატურალური რიცხვი უკუსვლით



// 3) დაპრინტეთ ლუწი  რიცხვები 0-დან 100-ის ჩათვლით



// 4) დაპრინტეთ კენტი რიცხვები 99-დან 1-ის ჩათვლით უკუსვლით



// 5) დაპრინტეთ პირველი 10 ნატურალური რიცხვის ჯამი(მინიშნება შექმენით ცვლადი სადაც შეინახავს რიცხვების ჯამს)



// 6)  input() ფუნქციის დახმარებით მომხმარებელს შემოაქვს ორი რიცხვი a და b. while ციკლის გამოყენებით ტერმინალში გამოიტანეთ რიცხვები a-დან b-მდე